GME Megathread for March 04, 2021
TIL that at an Allied checkpoint during the Battle of the Bulge, US General Omar Bradley was detained as a possible spy when he correctly identified Springfield as the capital of Illinois. The American military police officer who questioned him mistakenly believed the capital was Chicago
Have you ever met a really intelligent person who didn’t really know how smart they were? What was your experience with them?
Biden called off second Syria strike after last minute warning of woman and children at target site
Just Samuel L. Jackson doing Samuel L. Jackson things
Ethics Report Finds Elaine Chao Used Trump Cabinet Post to Promote Family Interests
New images from Space Jam: A New Legacy
When WSB hates Robinhood yet still posts a bunch of position screenshots from RH:
Report: New Nintendo Switch With 4K Output, OLED Screen Will Release Before Christmas
Yuta Watanabe on the Dunk: "not going for the block was never an option for me. If I had 100 opportunities to block a dunk and I could block just one of those 100, I will continue to try to block them."
Octopuses, the most neurologically complex invertebrates, both feel pain and remember it, responding with sophisticated behaviors, demonstrating that the octopus brain is sophisticated enough to experience pain on a physical and dispositional level, the first time this has been shown in cephalopods.
This Syrian child's anguish after a chemical attack
How NOT to sexually harass someone
The perfect transition
Fauci calls loosening Covid-19 restrictions inexplicable as variants threaten another surge
Only Republican to vote for police reform bill 'accidentally pressed the wrong ... button'
One day i'll be running this place
Meet Billy the Kid - Sharpened and animated by AI from only existing picture
Feels like just 5 minutes ago we were all talking about being Jedi
"I will shoot whoever I see": Myanmar soldiers use TikTok to threaten protesters
She chewed up her red holee roller ball and now our mask collection is complete. We finally got one in every color
A WWI German Soldier recalls fighting a French Soldier and leaves a very important message about War
Models aren’t beauty “standards”. They’re exceptional, that’s why they’re models. If you compare yourself to them and feel bad, that’s on you.
Bible Kid Preaches about god to an LGBTQ Atheist with green hair and chase ensues
Golden mouse with wavy fur!
